[
  {
    "id": "the-reason-for-average",
    "title": "Why Average & Active Exists — And Why It's Different",
    "category": "mindset",
    "emoji": "💭",
    "image": "images/why-average-and-active.jpg",
    "excerpt": "The fitness world is full of peak athletes, product pushes, and perfect lighting. This isn't that. This is real life, real fitness, and the reason average matters.",
    "date": "2026-02-08",
    "readTime": "4 min",
    "featured": true,
    "status": "published",
    "body": [
      {
        "type": "paragraph",
        "text": "Today kicks off another social platform around fitness, health, family, food, etc. Here are the reasons this one is different than the masses."
      },
      {
        "type": "heading",
        "text": "1. Not enough real"
      },
      {
        "type": "paragraph",
        "text": "I follow a lot of fitness influencers across multiple platforms. I have respect for each of them but have quickly found they are all peak level athletes in their youth. It is great to watch their journeys but I quickly feel defeated in my own journey."
      },
      {
        "type": "heading",
        "text": "2. Unrelatable"
      },
      {
        "type": "paragraph",
        "text": "A lot of the current content out in the wild is unrelatable, at least for me. I find it hard to relate to pro athletes, I find it hard to relate to someone that doesn't have kids, I find it hard to relate to someone much younger, I find it hard to relate to athletes in their peak era, and I find it hard to relate to someone that has their career around fitness. As said above, I respect their journeys but they are all very hard to relate to in my current stage of life."
      },
      {
        "type": "heading",
        "text": "3. Pushing product"
      },
      {
        "type": "paragraph",
        "text": "Once I find someone that I can relate to, over time, they start to push products. Products that make them money. Products that don't help my journey. It becomes more of an ad than actual content. That is not my goal here, my goal is to share my journey and make it accessible. I don't want to push ads as ads already exist within platforms. You don't need more ads. You need more content that matters."
      },
      {
        "type": "heading",
        "text": "4. Posting the hard"
      },
      {
        "type": "paragraph",
        "text": "At times, the influencers push the good and not the bad. Life is hard, we need to see it all. The journey has peaks and valleys. It isn't all rainbows and sunshine. I want my content to be real and felt. I want mistakes to be shown, losses to be felt and relatable."
      },
      {
        "type": "heading",
        "text": "5. Tired of the fake"
      },
      {
        "type": "paragraph",
        "text": "I don't like the filters, I don't like the perfect lighting. As you follow people, you realize how easily a good day, lighting, and time of the day can turn into a picture that shows extreme progress. I love progress but nothing happens fast. It takes work, consistency, and time."
      },
      {
        "type": "paragraph",
        "text": "Overall, I am here to share my journey, make it relatable, make it felt and interact with others on a similar path. I am not here to push ads, I am not here to push products, and I am not looking to \"influence\" others."
      }
    ]
  },
  {
    "id": "macro-tracking-lazy-guide",
    "title": "Macro Tracking for People Who Hate Counting",
    "category": "nutrition",
    "emoji": "🥗",
    "excerpt": "A lazy person's guide to getting your protein, carbs, and fats roughly right without losing your mind or your enjoyment of food.",
    "date": "2026-01-28",
    "readTime": "6 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "I tried strict macro tracking for about three weeks before I wanted to throw my phone into a lake. Weighing every almond? Scanning every barcode? That's not sustainable when you're also packing lunches and negotiating with a 4-year-old about eating vegetables."
      },
      {
        "type": "heading",
        "text": "The 'Close Enough' Method"
      },
      {
        "type": "paragraph",
        "text": "Here's what I actually do: I track roughly. I know what a palm-sized portion of protein looks like. I know a fist of carbs. A thumb of fat. Is it accurate to the gram? No. Is it accurate enough to make progress? Absolutely."
      },
      {
        "type": "heading",
        "text": "My Daily Targets (Roughly)"
      },
      {
        "type": "list",
        "items": [
          "Protein: 150-180g (I aim for 40g per meal, 4 times a day)",
          "Carbs: 200-250g (more on training days, less on rest days)",
          "Fats: 60-70g (this usually takes care of itself)",
          "Total: ~2,200 calories"
        ]
      },
      {
        "type": "heading",
        "text": "The Staples That Make It Easy"
      },
      {
        "type": "paragraph",
        "text": "I eat roughly the same things during the week. Not because I'm boring — because decision fatigue is real when you have kids. Here are my go-tos:"
      },
      {
        "type": "list",
        "items": [
          "Breakfast: Eggs + toast or protein shake + banana",
          "Lunch: Chicken + rice bowl or turkey wrap",
          "Dinner: Whatever the family eats (I just adjust my portion)",
          "Snacks: Greek yogurt, protein bar, apple + almond butter"
        ]
      },
      {
        "type": "paragraph",
        "text": "Weekends are more flexible. We eat out, we have pizza night, we live our lives. I don't track on weekends — I just make generally smart choices and enjoy the time with family."
      },
      {
        "type": "heading",
        "text": "The One Non-Negotiable"
      },
      {
        "type": "paragraph",
        "text": "If there's one thing I'd tell anyone to focus on, it's protein. Hit your protein target and everything else falls into place more easily. You're less hungry, you recover better, and you maintain muscle as you age. That's the whole game."
      }
    ]
  },
  {
    "id": "working-out-with-toddler",
    "title": "Working Out With a Toddler in the Room",
    "category": "family",
    "emoji": "👨‍👧",
    "excerpt": "Yes, it's chaos. Yes, you'll get interrupted. Here's how to get a solid workout in anyway — tiny humans included.",
    "date": "2026-01-22",
    "readTime": "5 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "Let me paint you a picture: I'm mid-squat, barbell on my back, and my 3-year-old decides this is the perfect moment to show me her drawing. Of a cat. That needs a name. Right now."
      },
      {
        "type": "paragraph",
        "text": "If you're a parent who trains at home, you know exactly what I'm talking about. Here's how I've learned to make it work."
      },
      {
        "type": "heading",
        "text": "Accept the Chaos"
      },
      {
        "type": "paragraph",
        "text": "Step one: let go of the idea of an uninterrupted 45-minute session. It's not happening. Once I accepted that, I actually started enjoying the absurdity of it. My daughter does 'squats' next to me with a pool noodle. My son counts my reps (inaccurately). It's messy and kind of perfect."
      },
      {
        "type": "heading",
        "text": "Strategies That Actually Help"
      },
      {
        "type": "list",
        "items": [
          "Use rest periods for kid stuff — answer the question, fix the snack, find the toy",
          "Pick exercises that are safe to bail on (dumbbells > barbell when kids are around)",
          "Set up a 'kid station' nearby with coloring books, blocks, or a tablet",
          "Keep sessions short and intense — 25 minutes of focus beats 60 minutes of distraction",
          "Let them participate. Kid-sized dumbbells cost $10 and buy you infinite goodwill"
        ]
      },
      {
        "type": "heading",
        "text": "The Real Lesson"
      },
      {
        "type": "paragraph",
        "text": "Working out with your kids around isn't a limitation — it's modeling behavior. They see you prioritizing your health. They see you pushing through something hard. They see you showing up even when it's not easy. That's a lesson no amount of talking can teach."
      }
    ]
  },
  {
    "id": "zone-2-cardio-longevity",
    "title": "Zone 2 Cardio: The Boring Workout That Adds Years",
    "category": "longevity",
    "emoji": "⏳",
    "excerpt": "It doesn't look impressive. It won't get you likes. But zone 2 cardio might be the single best thing you can do for your health.",
    "date": "2026-01-18",
    "readTime": "7 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "Zone 2 cardio is the most boring and most important type of exercise I do. It's not sexy. There's no before-and-after transformation. But the science behind it for longevity is overwhelming."
      },
      {
        "type": "heading",
        "text": "What Is Zone 2?"
      },
      {
        "type": "paragraph",
        "text": "Zone 2 is the intensity where you can hold a conversation but it's slightly uncomfortable. You're breathing harder but you're not gasping. For most people, that's a brisk walk, an easy jog, or a moderate bike ride. Heart rate roughly 60-70% of your max."
      },
      {
        "type": "heading",
        "text": "Why It Matters"
      },
      {
        "type": "paragraph",
        "text": "Zone 2 training improves your mitochondrial function — basically, how efficiently your cells produce energy. It improves insulin sensitivity, cardiovascular health, and fat metabolism. Dr. Peter Attia calls it 'the most important exercise for longevity,' and after digging into the research, I agree."
      },
      {
        "type": "heading",
        "text": "How I Fit It In"
      },
      {
        "type": "list",
        "items": [
          "3-4 times per week, 30-45 minutes each",
          "Usually a walk with the dog or a bike ride on the weekend",
          "Sometimes I just walk on an incline treadmill while watching a show",
          "I wear a cheap heart rate monitor to stay in the right zone"
        ]
      },
      {
        "type": "paragraph",
        "text": "The beauty of zone 2 is that it doesn't beat you up. You can do it every day without affecting your recovery. It's the opposite of 'no pain, no gain' — and it's arguably more important for your long-term health than any heavy lifting session."
      },
      {
        "type": "heading",
        "text": "The Dad Walk"
      },
      {
        "type": "paragraph",
        "text": "My favorite zone 2 session? Walking the neighborhood with my kids on their bikes. They ride, I walk fast, we all get outside. Exercise that doubles as family time? That's the sweet spot."
      }
    ]
  },
  {
    "id": "5am-garage-gym-routine",
    "title": "The 5AM Garage Gym: How I Built a Routine That Actually Sticks",
    "category": "fitness",
    "emoji": "🏃‍♂️",
    "excerpt": "Everyone talks about morning routines. Here's what mine actually looks like — the good, the bad, and the days I hit snooze three times. How I went from zero consistency to never missing a weekday workout.",
    "date": "2026-01-15",
    "readTime": "8 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "I'm not going to pretend I wake up every morning fired up and ready to crush a workout. Some days, the alarm goes off at 4:55 AM and every part of me wants to stay in bed. But I get up anyway. And that's kind of the whole point."
      },
      {
        "type": "heading",
        "text": "Why 5AM?"
      },
      {
        "type": "paragraph",
        "text": "I didn't choose 5AM because I'm a morning person. I chose it because it's the only time that's truly mine. By 6:30, the kids are up. By 7:15, we're in full breakfast-backpack-bus-stop chaos. If I don't train before the house wakes up, it's not happening."
      },
      {
        "type": "paragraph",
        "text": "The garage gym helps too. No commute to a gym means I roll out of bed, throw on shorts, and I'm already there. The barrier to entry is literally just standing up."
      },
      {
        "type": "heading",
        "text": "The Actual Routine"
      },
      {
        "type": "paragraph",
        "text": "I keep it simple. Four days a week, alternating between upper and lower body. Each session is 35-45 minutes. Here's what a typical week looks like:"
      },
      {
        "type": "list",
        "items": [
          "Monday: Upper body (push focus) — bench press, overhead press, rows, curls",
          "Tuesday: Lower body — squats, Romanian deadlifts, lunges, calf raises",
          "Thursday: Upper body (pull focus) — pull-ups, dumbbell rows, face pulls, triceps",
          "Friday: Lower body + conditioning — deadlifts, leg press, kettlebell swings"
        ]
      },
      {
        "type": "paragraph",
        "text": "Wednesday is a rest day or a light walk. Weekends are for family hikes, backyard play, or just resting. No guilt."
      },
      {
        "type": "heading",
        "text": "What Made It Stick"
      },
      {
        "type": "paragraph",
        "text": "Three things changed everything for me:"
      },
      {
        "type": "list",
        "items": [
          "I stopped chasing perfection. A 20-minute session beats a skipped one.",
          "I laid out my clothes the night before. Removes one more decision.",
          "I tracked consistency, not weight. My goal is 4 sessions per week, not a PR."
        ]
      },
      {
        "type": "paragraph",
        "text": "The first two weeks were brutal. But after that, it became automatic. Now it feels weird NOT to train in the morning."
      },
      {
        "type": "heading",
        "text": "The Honest Truth"
      },
      {
        "type": "paragraph",
        "text": "I still have bad days. Last week I slept through my alarm twice. The week before, my kid was sick and I was up all night. Life happens. The difference is I don't let one missed day turn into a missed week anymore."
      },
      {
        "type": "paragraph",
        "text": "If you're thinking about starting a morning routine — start smaller than you think. Even 15 minutes. The habit of showing up matters more than the workout itself."
      }
    ]
  },
  {
    "id": "why-good-enough-is-the-goal",
    "title": "Why \"Good Enough\" Is the Goal",
    "category": "mindset",
    "emoji": "💭",
    "excerpt": "Perfectionism is the enemy of consistency. Here's why I stopped chasing optimal and started chasing sustainable — and got better results.",
    "date": "2026-01-12",
    "readTime": "5 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "For years, I'd start a fitness plan, go all-in for two or three weeks, and then crash. The plan was always too perfect — 6 workouts a week, meal prep every Sunday, no cheat meals, sleep by 10 PM. Real life doesn't work like that."
      },
      {
        "type": "heading",
        "text": "The Shift"
      },
      {
        "type": "paragraph",
        "text": "The turning point came when I lowered my standards. Not in a giving-up way — in a realistic way. Instead of 6 workouts, I aimed for 3. Instead of perfect nutrition, I aimed for 'mostly good.' Instead of no junk food, I aimed for 80/20."
      },
      {
        "type": "paragraph",
        "text": "And something unexpected happened: I actually stuck with it. For the first time in years, I was consistent. And consistency beat intensity every single time."
      },
      {
        "type": "heading",
        "text": "The Math of 'Good Enough'"
      },
      {
        "type": "list",
        "items": [
          "Perfect plan followed for 3 weeks = 18 workouts, then 0",
          "Good enough plan followed for 12 months = 150+ workouts",
          "Guess which one gets better results?"
        ]
      },
      {
        "type": "heading",
        "text": "What 'Good Enough' Looks Like"
      },
      {
        "type": "paragraph",
        "text": "For me, good enough means: train 3-4 times a week, eat mostly whole foods, get 7+ hours of sleep most nights, walk daily, and don't stress the rest. Some weeks are better than others. That's fine. The trend line is what matters, not any single day."
      },
      {
        "type": "paragraph",
        "text": "Give yourself permission to be imperfect. It's the most productive thing you'll ever do for your health."
      }
    ]
  },
  {
    "id": "home-gym-equipment-blog",
    "title": "My Home Gym Equipment",
    "category": "fitness",
    "emoji": "🏋️",
    "image": "images/home-gym.jpg",
    "excerpt": "A real look at every piece of equipment in my home gym — what's worth it, what's wearing out, and how it all supports triathlon training and staying strong for the long haul.",
    "date": "2026-01-08",
    "readTime": "6 min",
    "featured": false,
    "status": "published",
    "body": [
      {
        "type": "heading",
        "text": "My Home Gym Setup: Everything I Use (And What's Actually Worth It)"
      },
      {
        "type": "paragraph",
        "text": "*Real talk about the equipment that keeps this dad moving — no sponsorships, no BS.*"
      },
      {
        "type": "paragraph",
        "text": "If you've ever thought about building a home gym, you've probably fallen down the rabbit hole of \"ultimate setup\" videos from people with $50K garage gyms and lighting rigs that belong on a film set. That's not this post."
      },
      {
        "type": "paragraph",
        "text": "This is what a real home gym looks like when you're a parent, you train around nap times and work calls, and you need gear that earns its square footage. I've built mine out over time, and every piece in here has to justify its spot. Here's the full rundown."
      },
      {
        "type": "heading",
        "text": "The Rack: REP Ares 2.0"
      },
      {
        "type": "paragraph",
        "text": "This is the centerpiece. If you're only going to invest in one big piece of equipment, make it a quality rack — and the REP Ares 2.0 has been worth every penny."
      },
      {
        "type": "paragraph",
        "text": "Mine came with the pull-up bar, safety straps, and a large squat area, which covers about 80% of what I need for strength training. Squats, bench press, overhead press, pull-ups, rack pulls — it all happens here. The safety straps are a non-negotiable when you're training solo. Nobody's spotting me on my lunch break, and I'm not about to get pinned under a bar between meetings."
      },
      {
        "type": "paragraph",
        "text": "Here's the thing nobody talks about enough: if you're an endurance athlete, you still need to be lifting. Muscle mass doesn't just stick around — you lose it as you age, and all that cardio volume from tri training isn't doing you any favors on the preservation front. A solid rack makes it easy to keep the big compound lifts in your routine, even during heavy training blocks. That's how you stay strong and functional for the long haul, not just the next race."
      },
      {
        "type": "heading",
        "text": "Concept 2 Rower & SkiErg"
      },
      {
        "type": "paragraph",
        "text": "These two are the cardio backbone of my gym. If you know, you know — Concept 2 basically wrote the book on rowing machines, and there's a reason they're everywhere."
      },
      {
        "type": "paragraph",
        "text": "The **rower** is my go-to for steady-state cardio, warm-ups, and those days when I need to move but my legs are toast from yesterday's squats or a long ride. It's also a full-body workout disguised as \"just cardio,\" which is sneaky efficient when you're short on time. For triathlon training, it's a great low-impact way to build aerobic capacity without adding more run or bike volume to already tired legs."
      },
      {
        "type": "paragraph",
        "text": "The **SkiErg** is a different beast. It hammers your upper body and core in a way that nothing else really replicates. I use it for intervals and upper body conditioning — and it translates surprisingly well to the swim portion of tri training. That pulling pattern and the demand on your lats and shoulders carries over more than you'd think. It also takes up almost no floor space since it mounts to the wall — big win in a home gym."
      },
      {
        "type": "paragraph",
        "text": "**Worth noting:** Both of these hold their resale value like crazy. If you ever decide to move on, you'll get most of your money back. That's rare for fitness equipment."
      },
      {
        "type": "heading",
        "text": "The Hex (Trap) Bar"
      },
      {
        "type": "paragraph",
        "text": "If I could only do one lower body movement for the rest of my life, hex bar deadlifts would be in the conversation. It's more forgiving on your lower back than a straight bar, the learning curve is way shorter, and you can load it heavy without worrying as much about form breaking down when you're fatigued."
      },
      {
        "type": "paragraph",
        "text": "From a longevity standpoint, this is one of the best tools in the gym. You're training your posterior chain, grip strength, and total body tension — all things that decline with age if you don't stay on top of them. And for a dad who's been sitting at a desk all day before squeezing in a workout, the hex bar lets you pull heavy with less risk. That matters when the goal is still being able to do this stuff in your 50s, 60s, and beyond."
      },
      {
        "type": "heading",
        "text": "Kettlebells"
      },
      {
        "type": "paragraph",
        "text": "I've got a set of kettlebells and they're some of the most versatile pieces in the gym. Swings, goblet squats, Turkish get-ups, farmer carries, cleans — the list doesn't end. They're also perfect for those days when you've got 20 minutes and need to get after it with minimal transition time."
      },
      {
        "type": "paragraph",
        "text": "What I really appreciate about kettlebells is how well they build the kind of functional, durable strength that actually ages well. Hip hinges, loaded carries, single-leg work — this is the stuff that keeps you moving well as the years add up. Not flashy, but incredibly effective."
      },
      {
        "type": "paragraph",
        "text": "If you're starting out, a single kettlebell in the right weight can keep you busy for months before you even think about adding another."
      },
      {
        "type": "heading",
        "text": "Adjustable Dumbbells"
      },
      {
        "type": "paragraph",
        "text": "I'll be honest — mine are starting to show their age. The adjustment mechanism is wearing thin, and they're on the list for an upgrade. But adjustable dumbbells are still one of the smartest purchases you can make for a home gym. They replace an entire dumbbell rack in a fraction of the space."
      },
      {
        "type": "paragraph",
        "text": "When they work well, they're perfect for accessory work, isolation movements, and filling in the gaps that barbells miss. Think single-arm rows, lateral raises, chest flyes — the stuff that keeps your shoulders healthy and your stabilizers strong, especially when you're putting in big swim, bike, and run volume. Just know that the moving parts *will* wear over time, especially if you're using them hard and often. Something to factor into your budget — they're not a buy-it-once-forever piece like a Concept 2."
      },
      {
        "type": "heading",
        "text": "70lb Slam Ball"
      },
      {
        "type": "paragraph",
        "text": "This thing is pure therapy. Bad day at work? Slam ball. Kids tested every last nerve? Slam ball. Need to build some explosive power? Also slam ball."
      },
      {
        "type": "paragraph",
        "text": "At 70 pounds, it's no joke. Slam ball work builds power, core strength, and conditioning all at once. It's also one of the few pieces of equipment where you're actively encouraged to throw it as hard as you can into the ground. Very cathartic. Highly recommend."
      },
      {
        "type": "paragraph",
        "text": "And from a longevity perspective — explosive power is one of the first things to go as you age. Rate of force development drops off faster than raw strength does. Keeping some power work in your routine, even just slam balls a couple times a week, is an investment in your future self."
      },
      {
        "type": "heading",
        "text": "The Treadmill"
      },
      {
        "type": "paragraph",
        "text": "This is the newest addition to the gym — just added it about a week ago — and I'm already wondering why I waited so long. Nobody's posting treadmill content that goes viral. But having one in the gym means I never have an excuse to skip a run. Weather's bad? Treadmill. It's dark and icy outside? Treadmill. Need to do intervals and control the pace precisely? Treadmill."
      },
      {
        "type": "paragraph",
        "text": "For tri training, I can already tell this is going to get a lot of use. Structured run sessions where I need to hit specific paces, bad weather days where I'd otherwise skip — it just removes the excuses. And the thing I'm most looking forward to is stacking a run onto the back of a bike session for brick workouts. Having it ten feet away from the trainer is going to be pretty clutch once tri season ramps up."
      },
      {
        "type": "paragraph",
        "text": "The other big one — I train at 6,200 feet. Running outside at altitude with hills means my heart rate is all over the place, which makes it really hard to train in specific zones. The treadmill lets me control the terrain and the climate, keep my heart rate where it needs to be, and actually dial in my training instead of just guessing. At elevation, that kind of control matters more than most people realize."
      },
      {
        "type": "heading",
        "text": "The Bike Trainer: Wahoo + Zwift Setup"
      },
      {
        "type": "paragraph",
        "text": "This one lives in the spare room, and it deserves its own post at some point. The Wahoo trainer paired with Zwift has been a game-changer for tri training. Being able to hop on and ride structured workouts or jump into a group ride without leaving the house is massive when you've got a family schedule to work around."
      },
      {
        "type": "paragraph",
        "text": "Zwift makes indoor riding way more tolerable than staring at a wall, and the structured training plans are legit. It's also nice having it in a separate room — keeps the gym feeling like a gym and the bike space feeling like its own zone where I can lock in."
      },
      {
        "type": "paragraph",
        "text": "For anyone juggling family life and triathlon, an indoor setup like this isn't optional — it's how training actually happens consistently."
      },
      {
        "type": "heading",
        "text": "The Honest Truth About Building a Home Gym"
      },
      {
        "type": "paragraph",
        "text": "I didn't buy all of this at once. It's been built up piece by piece, usually when I found a good deal or identified a real gap in my training. The best advice I can give is: **start with what supports the training you actually do**, not the training you think you *should* do."
      },
      {
        "type": "paragraph",
        "text": "A rack, some free weights, and one solid cardio machine will get most people further than they think. Everything else is a bonus."
      },
      {
        "type": "paragraph",
        "text": "My training is built around two things: triathlon and keeping muscle on my frame for as long as possible. Those might sound like they're at odds with each other, but they're not — you just have to be intentional. The endurance work keeps my heart and lungs healthy. The strength work keeps my body resilient, protects my joints, and makes sure I'm not just a skinny dude who can run far. Both matter if the goal is being active and capable for decades, not just for the next race."
      },
      {
        "type": "paragraph",
        "text": "And if you're a parent reading this — a home gym isn't a luxury. It's logistics. It's the difference between \"I'll go to the gym after bedtime\" (which never happens) and actually getting it done. That's worth the investment."
      },
      {
        "type": "paragraph",
        "text": "*Got questions about any of this gear? Drop a comment or hit me up on Instagram. Always happy to talk shop.*"
      }
    ]
  },
  {
    "id": "only-5-exercises-you-need",
    "title": "The Only 5 Exercises You Actually Need",
    "category": "fitness",
    "emoji": "🏋️",
    "excerpt": "Forget the complicated routines. If you can do these five movements consistently, you're ahead of 90% of the population.",
    "date": "2026-01-08",
    "readTime": "6 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "The fitness industry wants you to think you need 47 different exercises, a periodized program, and a PhD in kinesiology. You don't. If you're a parent just trying to stay healthy and functional, here are the only five movements that matter."
      },
      {
        "type": "heading",
        "text": "1. Squat"
      },
      {
        "type": "paragraph",
        "text": "Barbell, goblet, bodyweight — doesn't matter. Squatting keeps your legs strong, your knees healthy, and your ability to get off the floor intact as you age. I do goblet squats with a dumbbell 2x per week. Nothing fancy."
      },
      {
        "type": "heading",
        "text": "2. Hinge (Deadlift)"
      },
      {
        "type": "paragraph",
        "text": "Picking heavy stuff off the ground. This builds your back, glutes, and hamstrings — the muscles that protect your spine when you're lifting kids, groceries, or furniture. Romanian deadlifts with dumbbells are my go-to."
      },
      {
        "type": "heading",
        "text": "3. Push (Bench Press / Push-Ups)"
      },
      {
        "type": "paragraph",
        "text": "Upper body pushing. Bench press, push-ups, overhead press — pick one or rotate. This keeps your chest, shoulders, and arms strong for carrying kids, pushing strollers, and everyday life."
      },
      {
        "type": "heading",
        "text": "4. Pull (Rows / Pull-Ups)"
      },
      {
        "type": "paragraph",
        "text": "The counterbalance to all that pushing (and all that sitting at a desk). Rows and pull-ups build the back muscles that keep your posture solid. I do dumbbell rows every upper body day."
      },
      {
        "type": "heading",
        "text": "5. Carry (Farmer's Walk)"
      },
      {
        "type": "paragraph",
        "text": "Grab two heavy dumbbells and walk. That's it. This builds grip strength, core stability, and total body endurance. It's also the most 'real life' exercise there is — when was the last time you carried a sleeping child plus three bags of groceries up the stairs?"
      },
      {
        "type": "heading",
        "text": "The Bottom Line"
      },
      {
        "type": "paragraph",
        "text": "Master these five movements and you're set. You don't need fancy equipment, a gym membership, or a complicated program. Just these five, done consistently, with gradual progress. That's the whole recipe."
      }
    ]
  },
  {
    "id": "meal-prep-sunday-real-parent",
    "title": "Meal Prep Sunday: A Real Parent's Version",
    "category": "nutrition",
    "emoji": "🥑",
    "excerpt": "I've got about 90 minutes on Sunday afternoon. Here's how I prep meals for the week that the whole family will actually eat.",
    "date": "2026-01-04",
    "readTime": "8 min",
    "featured": false,
    "status": "draft",
    "body": [
      {
        "type": "paragraph",
        "text": "Every meal prep guide I've seen assumes you have 4 hours, 30 containers, and zero children. Here's my version — the one that actually works when you've got a 90-minute window while the kids are doing quiet time."
      },
      {
        "type": "heading",
        "text": "The 90-Minute Game Plan"
      },
      {
        "type": "paragraph",
        "text": "I don't prep every meal for the week. I prep the things that, if I don't have ready, will lead me to order takeout. That means: protein, grains, and a few snacks."
      },
      {
        "type": "heading",
        "text": "What I Actually Prep"
      },
      {
        "type": "list",
        "items": [
          "2 lbs chicken breast — seasoned and baked (used in bowls, wraps, salads all week)",
          "A big pot of rice or quinoa",
          "Cut vegetables — peppers, cucumbers, cherry tomatoes",
          "Hard-boiled eggs (a dozen)",
          "Overnight oats for 3 mornings (oats, protein powder, milk, chia seeds in jars)"
        ]
      },
      {
        "type": "heading",
        "text": "The Family Crossover"
      },
      {
        "type": "paragraph",
        "text": "Here's the trick: most of what I prep works for the whole family. The chicken goes into the kids' quesadillas. The rice goes with their dinner. I'm not making two separate meals — I'm making building blocks that everyone can use differently."
      },
      {
        "type": "paragraph",
        "text": "Dinners are still cooked fresh most nights — usually something simple like sheet pan chicken and veggies, turkey tacos, or pasta. The prep just handles lunches and breakfasts so I'm not scrambling every morning."
      },
      {
        "type": "heading",
        "text": "My Advice"
      },
      {
        "type": "paragraph",
        "text": "Don't try to be a meal prep influencer. You don't need 15 matching containers and a color-coded menu. Just cook some protein, cook some carbs, and cut some vegetables. That's 80% of the battle right there."
      }
    ]
  }
]
