[
  {
    "title": "Apple Slices & Almond Butter",
    "mealType": "snack",
    "emoji": "🍎",
    "description": "Simple, satisfying, and portable. Two tablespoons of almond butter with a sliced apple. The 3PM savior.",
    "prepTime": "2 min",
    "servings": 1,
    "difficulty": "Easy",
    "calories": 220,
    "protein": 14,
    "carbs": 25,
    "fat": 8,
    "tags": [
      "quick",
      "no-cook"
    ],
    "ingredients": [
      "1 medium apple (Honeycrisp or Fuji work great)",
      "2 tbsp almond butter",
      "Optional: sprinkle of cinnamon",
      "Optional: drizzle of honey"
    ],
    "steps": [
      "Wash and slice apple into wedges.",
      "Serve with almond butter for dipping.",
      "Optional: sprinkle cinnamon on top or drizzle with a tiny bit of honey."
    ],
    "status": "draft",
    "id": "apple-slices-almond-butter"
  },
  {
    "title": "Chicken & Rice Power Bowl",
    "mealType": "lunch",
    "emoji": "🥗",
    "description": "Grilled chicken, brown rice, black beans, avocado, and salsa. Meal prep king — makes 4 at once.",
    "prepTime": "25 min",
    "servings": 4,
    "difficulty": "Easy",
    "calories": 480,
    "protein": 42,
    "carbs": 35,
    "fat": 16,
    "tags": [
      "high-protein",
      "meal-prep"
    ],
    "ingredients": [
      "1.5 lbs chicken breast",
      "2 cups brown rice (dry)",
      "1 can (15 oz) black beans, drained and rinsed",
      "2 avocados, sliced",
      "1 cup salsa",
      "1 lime",
      "1 tsp cumin",
      "1 tsp garlic powder",
      "Salt and pepper to taste"
    ],
    "steps": [
      "Cook brown rice according to package directions.",
      "Season chicken with cumin, garlic powder, salt, and pepper.",
      "Grill or pan-sear chicken for 6-7 minutes per side until cooked through (165°F internal).",
      "Let chicken rest 5 minutes, then slice into strips.",
      "Divide rice between 4 bowls or containers.",
      "Top each with chicken, black beans, sliced avocado, and salsa.",
      "Squeeze lime over each bowl. Refrigerate meal prep portions for up to 4 days."
    ],
    "status": "draft",
    "id": "chicken-rice-power-bowl"
  },
  {
    "title": "Classic Sourdough at Elevation",
    "mealType": "breakfast",
    "emoji": "🍞",
    "image": "images/classic-sourdough-at-elevation.JPG",
    "description": "A homemade sourdough recipe tuned for high altitude. 24-hour process, four simple ingredients, and a crackling crust that makes every slice worth the wait.",
    "prepTime": "24 hrs",
    "servings": 12,
    "difficulty": "Medium",
    "calories": 160,
    "protein": 5,
    "carbs": 32,
    "fat": 1,
    "tags": [
      "sourdough",
      "bread",
      "homemade",
      "fermented",
      "high-altitude",
      "dutch-oven",
      "meal-prep",
      "whole-food",
      "dairy-free",
      "vegan"
    ],
    "ingredients": [
      "500g bread flour (or all-purpose flour)",
      "400g water (room temperature)",
      "125g active sourdough starter (fed and doubled)",
      "13g fine sea salt",
      "Rice flour for dusting the proofing basket"
    ],
    "steps": [
      "Feed your starter first thing in the morning. Use a 1:1:1 ratio of starter, flour, and water. Let it sit at room temperature until it has at least doubled in size and looks domed and bubbly — this usually takes 4 to 6 hours depending on your kitchen temperature. A warm spot (75–80°F) speeds things up. The starter is ready when a small spoonful floats in water.",
      "In a large mixing bowl, combine 500g flour and 400g water. Mix with your hands or a Danish dough whisk until no dry flour remains — the dough will look shaggy and rough, and that is exactly right. Cover the bowl with a damp towel or plastic wrap and let it rest (autolyse) for 45 minutes. This rest lets the flour fully hydrate and starts gluten development before you ever touch it again.",
      "After the autolyse, add 125g of your peaked starter and 13g salt directly on top of the dough. Pinch and fold the starter and salt into the dough until fully incorporated — this takes about 3 to 4 minutes. The dough will feel shaggy at first but will start coming together. Squeeze it through your fingers rather than kneading to keep things even.",
      "Perform a set of stretch and folds: wet your hand, grab one side of the dough, stretch it up and fold it over to the opposite side. Rotate the bowl 90 degrees and repeat. Do all four sides — that is one set. Repeat this every 15 to 30 minutes for a total of 4 sets. You will feel the dough tighten and become smoother with each round. This builds the gluten structure that gives sourdough its open crumb.",
      "After the final stretch and fold, cover the bowl tightly with plastic wrap and leave it on the counter for bulk fermentation. At high altitude, fermentation can move faster due to lower air pressure, so start checking around 6 to 8 hours. The dough is ready when it has grown by roughly 50 percent, feels airy and jiggly, and you can see bubbles along the sides of the bowl.",
      "Dust your countertop generously with rice flour. Gently turn the dough out — do not punch it down or deflate it. Use a bench scraper and your hands to pre-shape the dough into a round. Let it rest uncovered for 15 to 20 minutes to relax the gluten.",
      "Shape the loaf by pulling the edges of the dough toward the center, then flipping it seam-side down. Using both hands, cup the dough and drag it gently toward you on the unfloured surface to build tension in the outer skin. The surface should feel taut and smooth — this tension is what gives you a good oven spring and that signature ear.",
      "Dust a proofing basket (banneton) generously with rice flour. Place the shaped dough seam-side up into the basket. Cover tightly with plastic wrap so it does not dry out. Place the basket in the refrigerator for an overnight cold proof — 10 to 14 hours. The cold retard slows fermentation, develops deeper tangy flavor, and makes the dough much easier to score and handle the next morning.",
      "The next morning, you have some flexibility on when to bake. Pulling it out anywhere between 10 and 14 hours works well. A shorter cold proof gives a milder flavor and more oven spring. A longer proof develops more sour tang and a slightly denser crumb. Find the window that matches the flavor and texture you prefer — this is where sourdough becomes your own.",
      "Place your Dutch oven (lid on) into the oven and preheat to 500°F. Let it heat for at least 30 minutes so the pot is ripping hot — this is critical for the initial burst of steam that creates a crispy crust.",
      "While the oven preheats, take the proofing basket out of the fridge. Invert the dough onto a sheet of parchment paper. Using a sharp razor blade or bread lame held at a 45-degree angle, score a single swift slash about a quarter-inch deep across the top of the loaf. A confident, quick motion works best — hesitation leads to dragging.",
      "Carefully lift the dough (using the parchment as a sling) into the screaming-hot Dutch oven. Cover with the lid. Bake at 500°F for 25 minutes with the lid on. The trapped steam creates the blistered, crackly crust.",
      "After 25 minutes, remove the lid and reduce the oven temperature to 475°F. Bake uncovered for another 10 to 15 minutes until the crust is deep golden brown — go darker than you think. A well-baked crust should sound hollow when you tap the bottom of the loaf.",
      "Remove the loaf from the Dutch oven and place it on a wire cooling rack. This is the hardest part — let it cool for at least 1 to 2 hours before slicing. The inside is still cooking from residual heat, and cutting too early lets the steam escape, leaving you with a gummy interior. Trust the process."
    ],
    "status": "draft",
    "id": "classic-sourdough-at-elevation"
  },
  {
    "title": "Lemon Herb Salmon & Asparagus",
    "mealType": "dinner",
    "emoji": "🐟",
    "description": "Salmon fillet with lemon, garlic, herbs, and roasted asparagus. Fancy-looking but dead simple to make.",
    "prepTime": "20 min",
    "servings": 2,
    "difficulty": "Easy",
    "calories": 440,
    "protein": 38,
    "carbs": 32,
    "fat": 20,
    "tags": [
      "high-protein",
      "quick"
    ],
    "ingredients": [
      "2 salmon fillets (6 oz each)",
      "1 bunch asparagus, trimmed",
      "2 tbsp olive oil",
      "2 cloves garlic, minced",
      "1 lemon (half for juice, half for slices)",
      "1 tsp dried oregano or Italian seasoning",
      "Salt and pepper to taste",
      "Optional: 1 cup cooked quinoa per serving"
    ],
    "steps": [
      "Preheat oven to 400°F (200°C).",
      "Place asparagus on a sheet pan, drizzle with 1 tbsp olive oil, salt, and pepper.",
      "Season salmon with garlic, oregano, salt, pepper, and a squeeze of lemon juice.",
      "Place salmon on the pan with the asparagus. Top with lemon slices.",
      "Drizzle salmon with remaining olive oil.",
      "Bake for 12-15 minutes until salmon flakes easily and asparagus is tender.",
      "Serve with cooked quinoa if you want extra carbs."
    ],
    "status": "draft",
    "id": "lemon-herb-salmon-asparagus"
  },
  {
    "title": "Loaded Egg & Veggie Scramble",
    "mealType": "breakfast",
    "emoji": "🍳",
    "description": "Three eggs, spinach, peppers, and feta with whole wheat toast. The weekday morning staple.",
    "prepTime": "10 min",
    "servings": 1,
    "difficulty": "Easy",
    "calories": 420,
    "protein": 35,
    "carbs": 28,
    "fat": 18,
    "tags": [
      "high-protein",
      "quick"
    ],
    "ingredients": [
      "3 large eggs",
      "1 cup fresh spinach",
      "1/4 bell pepper, diced",
      "2 tbsp crumbled feta cheese",
      "1 slice whole wheat toast",
      "1 tsp olive oil",
      "Salt and pepper to taste"
    ],
    "steps": [
      "Heat olive oil in a non-stick pan over medium heat.",
      "Add diced bell pepper and cook for 2 minutes until slightly softened.",
      "Add spinach and stir until wilted, about 1 minute.",
      "Crack eggs into the pan and scramble with the vegetables.",
      "Cook until eggs are set but still slightly soft, about 2-3 minutes.",
      "Top with crumbled feta, salt, and pepper.",
      "Serve with whole wheat toast."
    ],
    "status": "draft",
    "id": "loaded-egg-veggie-scramble"
  },
  {
    "title": "PB & Banana Protein Shake",
    "mealType": "smoothie",
    "emoji": "🥤",
    "description": "Banana, peanut butter, protein powder, milk, and ice. Takes 3 minutes. Tastes like dessert. Post-workout go-to.",
    "prepTime": "3 min",
    "servings": 1,
    "difficulty": "Easy",
    "calories": 340,
    "protein": 30,
    "carbs": 42,
    "fat": 10,
    "tags": [
      "high-protein",
      "quick",
      "post-workout"
    ],
    "ingredients": [
      "1 scoop vanilla or chocolate protein powder",
      "1 medium banana",
      "1 tbsp natural peanut butter",
      "1 cup milk (dairy or almond)",
      "1/2 cup ice",
      "Optional: 1 tsp honey"
    ],
    "steps": [
      "Add milk and peanut butter to blender first.",
      "Add banana (frozen works great), protein powder, and ice.",
      "Blend on high for 30-45 seconds until smooth.",
      "Add honey if you want extra sweetness. Serve immediately."
    ],
    "status": "draft",
    "id": "pb-banana-protein-shake"
  },
  {
    "title": "Protein Pancakes",
    "mealType": "breakfast",
    "emoji": "🥞",
    "description": "Oats, banana, egg whites, and protein powder. The kids love these too — weekend breakfast that doesn't derail you.",
    "prepTime": "15 min",
    "servings": 2,
    "difficulty": "Easy",
    "calories": 380,
    "protein": 28,
    "carbs": 40,
    "fat": 10,
    "tags": [
      "high-protein",
      "family-friendly"
    ],
    "ingredients": [
      "1 cup rolled oats",
      "1 medium banana",
      "4 egg whites (or 2 whole eggs)",
      "1 scoop vanilla protein powder",
      "1/2 cup milk",
      "1 tsp baking powder",
      "1 tsp vanilla extract",
      "Cooking spray or butter for pan",
      "Toppings: berries, maple syrup, peanut butter"
    ],
    "steps": [
      "Blend oats, banana, egg whites, protein powder, milk, baking powder, and vanilla in a blender until smooth.",
      "Heat a non-stick pan or griddle over medium heat and spray with cooking spray.",
      "Pour about 1/4 cup batter per pancake.",
      "Cook until bubbles form on surface, about 2-3 minutes, then flip.",
      "Cook another 1-2 minutes until golden.",
      "Serve with berries, a drizzle of maple syrup, or a tablespoon of peanut butter."
    ],
    "status": "draft",
    "id": "protein-pancakes"
  },
  {
    "title": "Sheet Pan Chicken & Veggies",
    "mealType": "dinner",
    "emoji": "🍗",
    "description": "Everything on one pan. Chicken thighs, sweet potatoes, broccoli, olive oil. Minimal dishes, maximum flavor.",
    "prepTime": "35 min",
    "servings": 4,
    "difficulty": "Easy",
    "calories": 520,
    "protein": 45,
    "carbs": 40,
    "fat": 18,
    "tags": [
      "meal-prep",
      "family-friendly"
    ],
    "ingredients": [
      "8 bone-in chicken thighs",
      "2 large sweet potatoes, cubed",
      "2 cups broccoli florets",
      "2 tbsp olive oil",
      "1 tsp paprika",
      "1 tsp garlic powder",
      "1 tsp onion powder",
      "Salt and pepper to taste"
    ],
    "steps": [
      "Preheat oven to 425°F (220°C).",
      "Cube sweet potatoes and toss with 1 tbsp olive oil, salt, and pepper on a large sheet pan.",
      "Season chicken thighs with paprika, garlic powder, onion powder, salt, and pepper.",
      "Nestle chicken on the pan with the sweet potatoes.",
      "Roast for 20 minutes.",
      "Add broccoli florets to the pan, drizzle with remaining olive oil.",
      "Roast for another 12-15 minutes until chicken reaches 165°F and vegetables are tender."
    ],
    "status": "draft",
    "id": "sheet-pan-chicken-veggies"
  },
  {
    "title": "Turkey Bolognese",
    "mealType": "dinner",
    "emoji": "🍝",
    "description": "Ground turkey, crushed tomatoes, garlic, and whole wheat pasta. A family favorite that hits the macros right.",
    "prepTime": "30 min",
    "servings": 4,
    "difficulty": "Easy",
    "calories": 550,
    "protein": 40,
    "carbs": 55,
    "fat": 14,
    "tags": [
      "family-friendly",
      "meal-prep"
    ],
    "ingredients": [
      "1.5 lbs ground turkey (93% lean)",
      "1 can (28 oz) crushed tomatoes",
      "4 cloves garlic, minced",
      "1 small onion, diced",
      "12 oz whole wheat spaghetti",
      "1 tbsp olive oil",
      "1 tsp Italian seasoning",
      "1/2 tsp red pepper flakes (optional)",
      "Salt and pepper to taste",
      "Fresh basil for topping"
    ],
    "steps": [
      "Cook pasta according to package directions. Drain and set aside.",
      "Heat olive oil in a large skillet over medium-high heat.",
      "Add diced onion and cook 3-4 minutes until softened.",
      "Add garlic and cook 30 seconds until fragrant.",
      "Add ground turkey, breaking it up with a spoon. Cook until browned, about 6-7 minutes.",
      "Add crushed tomatoes, Italian seasoning, red pepper flakes, salt, and pepper.",
      "Simmer on low for 10-15 minutes to let flavors develop.",
      "Serve over pasta and top with fresh basil."
    ],
    "status": "draft",
    "id": "turkey-bolognese"
  },
  {
    "title": "Turkey & Hummus Wrap",
    "mealType": "lunch",
    "emoji": "🌯",
    "description": "Whole wheat wrap, sliced turkey, hummus, spinach, cucumber, and a little feta. Packs well for work.",
    "prepTime": "5 min",
    "servings": 1,
    "difficulty": "Easy",
    "calories": 510,
    "protein": 38,
    "carbs": 45,
    "fat": 18,
    "tags": [
      "quick",
      "no-cook"
    ],
    "ingredients": [
      "1 large whole wheat tortilla wrap",
      "6 oz sliced turkey breast",
      "2 tbsp hummus",
      "1 cup fresh spinach",
      "1/4 cucumber, sliced thin",
      "2 tbsp crumbled feta",
      "Optional: pickled red onion"
    ],
    "steps": [
      "Lay wrap flat and spread hummus evenly across the center.",
      "Layer turkey slices over the hummus.",
      "Add spinach, cucumber slices, and feta.",
      "Fold in the sides, then roll tightly from the bottom.",
      "Cut in half diagonally. Wrap in foil for transport if meal prepping."
    ],
    "status": "draft",
    "id": "turkey-hummus-wrap"
  }
]
